# 1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
n = int(input('Введите число от 1 до 7: '))
if n >= 6:
    print ('да')
else:
    print ('нет')

